app/controllers/admin/blocks_controller.rb

  def index
    @blocks = Block.all
---
SELECT * FROM `blocks`

  def edit
    @block = Block.find(params[:id])
---
SELECT * FROM `blocks` WHERE (`blocks`.`id` = 1)

  def create
    @block = Block.new(params[:block])

    respond_to do |wants|
      if @block.save
---
INSERT INTO `blocks` (`created_at`, `updated_at`, `page_id`, `content`, `orientation`) VALUES('2010-03-16 13:33:07', '2010-03-16 13:33:07', 15, '<p>\r\n	asdf</p>\r\n', 'right')

  def update
    respond_to do |wants|
      if @block.update_attributes(params[:block])
---
UPDATE `blocks` SET `content` = '<div id=\"stolb\">\r\n			<img width=\"357\" height=\"409\" border=\"0\" alt=\"\" src=\"http://logomotiv.ru/about/images/short1.jpg\"/>\r\n			<div id=\"layer3\">\r\n				<a href=\"history/\"><img width=\"155\" height=\"64\" border=\"0\" onmouseout=\"this.src = pict1.src;\" onmouseover=\"this.src = pict2.src;\" alt=\"Подробно\" src=\"http://www.logomotiv.ru/about/images/short1.gif\"/></a></div>\r\n		</div>', `updated_at` = '2010-03-16 15:41:44' WHERE `id` = 1

    def find_block
      @block = Block.find(params[:id])
---
SELECT * FROM `blocks` WHERE (`blocks`.`id` = 7)