app/controllers/admin/clients_controller.rb

  def index
    @clients = Client.all
---
SELECT * FROM `clients`

  def show
    @client = Client.find(params[:id])
---
SELECT * FROM `clients` WHERE (`clients`.`id` = 1)

  def edit
    @client = Client.find(params[:id])
---
SELECT * FROM `clients` WHERE (`clients`.`id` = 1)

  def create
    @client = Client.new(params[:client])

    respond_to do |format|
      if @client.save
---
INSERT INTO `clients` (`created_at`, `title`, `updated_at`) VALUES('2010-03-15 12:11:01', 'Lumen', '2010-03-15 12:11:01')

  def update
    @client = Client.find(params[:id])
---
SELECT * FROM `clients` WHERE (`clients`.`id` = 1)