app/controllers/admin/pages_controller.rb

SELECT * FROM `pages` WHERE (parent_id IS NULL OR parent_id=0) ORDER BY id ASC
SELECT count(*) AS count_all FROM `pages` WHERE (`pages`.parent_id = 1)
---
  def index
    @pages = Page.all

SELECT * FROM `pages` WHERE (`pages`.`id` = 3)
---
  def edit
    @page = Page.find(params[:id])

INSERT INTO `pages` (`name`, `permalink`, `position`, `created_at`, `title`, `published`, `updated_at`, `lft`, `caching_level`, `template`, `parent_id`, `path`, `content`, `rgt`) VALUES(NULL, 'home', 1, '2010-03-04 14:39:28', 'главная', 1, '2010-03-04 14:39:28', 1, NULL, '', NULL, NULL, '', 2)
---
  def create
    #@parent_page = Page.find(params[:page][:parent_id])

    @page = Page.new(params[:page])
    #@page.move_to_child_of(@parent_page)

    respond_to do |wants|
      if @page.save

UPDATE `pages` SET `content` = '<div id=\"text1\">\r\n	<font class=\"quest\">Кто мы&nbsp;такие?</font><br />\r\n	<font class=\"why\">Дизайн-студия Logomotiv.</font><br />\r\n	<br />\r\n	<font class=\"quest\">Чем мы&nbsp;занимаемся?<br />\r\n	</font><font class=\"why\">Мы&nbsp;помогаем компаниям эффективно использовать<br />\r\n	дизайн в&nbsp;своем развитии.</font><br />\r\n	<br />\r\n	<font class=\"quest\">Для кого предназначена услуга?<br />\r\n	</font><font class=\"why\">Для смелых компаний и&nbsp;товаров, желающих<br />\r\n	обозначиться, выделиться, победить.<br />\r\n	</font><br />\r\n	<font class=\"quest\">Мы&nbsp;против!<br />\r\n	</font><font class=\"why\">Инерции, неподвижности, косности, тупизны.<br />\r\n	</font><br />\r\n	<font class=\"quest\">В&nbsp;чем наше отличие?<br />\r\n	</font><font class=\"why\">Мы&nbsp;занимаемся решением задач. Для нас дизайн&nbsp;&mdash; это мощный и&nbsp;гибкий инструмент для достижения цели, а&nbsp;не&nbsp;самоцель.</font>\r\n	<p class=\"portfolio\">\r\n		<a href=\"history/\">Подробно</a>&nbsp;&nbsp;<a href=\"history/\"><img alt=\"\" border=\"0\" height=\"7\" src=\"../../images/tuda.gif\" width=\"9\" /></a></p>\r\n</div>\r\n', `updated_at` = '2010-03-17 11:06:32', `meta_description` = 'bla blaa bla', `meta_keywords` = 'logomotiv, design' WHERE `id` = 19
---
  def update
    respond_to do |wants|
      if @page.update_attributes(params[:page])

DELETE FROM `pages` WHERE `id` = 5
---
  def destroy
    @page.destroy

SELECT * FROM `pages` WHERE (`pages`.`id` = 5)
SELECT count(*) AS count_all FROM `pages` WHERE (`pages`.parent_id = 5)
---
  def context_menu
    @page = Page.find(params[:id]) if params[:type] == 'page'

UPDATE `pages` SET position=1 WHERE (id='7')
---
  def sort
#render :text => params['.pages']
    if params['.pages']
      params['.pages'].each_with_index do |id, index|
        Page.update_all(['position=?', index+1], ['id=?', id])

SELECT * FROM `pages` WHERE (`pages`.`id` = 5)
SELECT max(`pages`.position) AS max_position FROM `pages` WHERE (1 = 1 AND (pages.parent_id IS NULL) AND pages.position IS NOT NULL)
---
    def find_page
      @page = Page.find(params[:id])