app/controllers/admin/posts_controller.rb

  def index
    @posts = Post.all
---
SELECT * FROM `posts`