app/controllers/admin/projects_controller.rb

  def index
    @projects = Project.all
---
SELECT * FROM `projects`

  def show
    @project = Project.find(params[:id])
---
SELECT * FROM `projects` WHERE (`projects`.`id` = 1)

  def edit
    @project = Project.find(params[:id])
---
SELECT * FROM `projects` WHERE (`projects`.`id` = 1)

  def create
    @project = Project.new(params[:project])

    respond_to do |format|
      if @project.save
---
INSERT INTO `projects` (`section`, `created_at`, `image_file_name`, `title`, `body`, `updated_at`, `image_content_type`, `client_id`, `sidebar`, `overs`) VALUES('ident', '2010-03-16 16:40:56', NULL, 'Торговая марка Lumen', '<p>\r\n	&nbsp;<img alt=\"\" src=\"/assets/pictures/1/content_head.gif?1268757117\" style=\"width: 449px; height: 228px; \" /></p>\r\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\" style=\"width: 100%; \">\r\n	<tbody>\r\n		<tr>\r\n			<td>\r\n				<p>\r\n					фыоарлоцурагшрцушг</p>\r\n				<p>\r\n					уйазшцгушщаг</p>\r\n				<p>\r\n					цулдарцурагшр</p>\r\n				<p>\r\n					аудоцлуаощшоцуа</p>\r\n			</td>\r\n			<td>\r\n				<img alt=\"\" src=\"/assets/pictures/2/content_card.jpg?1268757637\" style=\"width: 361px; height: 316px; \" /></td>\r\n		</tr>\r\n	</tbody>\r\n</table>', '2010-03-16 16:40:56', NULL, 1, '', '<p>\r\n	Нет пока нихера.</p>\r\n')

  def update
    @project = Project.find(params[:id])

    respond_to do |format|
      if @project.update_attributes(params[:project])
---
SELECT * FROM `projects` WHERE (`projects`.`id` = 1)
UPDATE `projects` SET `updated_at` = '2010-03-16 16:47:12', `body` = '<p>\r\n	&nbsp;<img alt=\"\" src=\"/assets/pictures/1/content_head.gif?1268757117\" style=\"width: 449px; height: 228px; \" /></p>\r\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\" style=\"width: 100%; \">\r\n	<tbody>\r\n		<tr>\r\n			<td style=\"width: 70%; \" valign=\"top\">\r\n				<p>\r\n					фыоарлоцурагшрцушг</p>\r\n				<p>\r\n					уйазшцгушщаг</p>\r\n				<p>\r\n					цулдарцурагшр</p>\r\n				<p>\r\n					аудоцлуаощшоцуа</p>\r\n			</td>\r\n			<td>\r\n				<p>\r\n					<img alt=\"\" src=\"/assets/pictures/2/content_card.jpg?1268757637\" style=\"width: 361px; height: 316px; \" /></p>\r\n				<p>\r\n					<span class=\"Apple-style-span\" style=\"-webkit-border-horizontal-spacing: 0px; -webkit-border-vertical-spacing: 0px;\"><span class=\"Apple-style-span\" style=\"-webkit-border-horizontal-spacing: 1px; -webkit-border-vertical-spacing: 1px;\">&nbsp;<span class=\"Apple-style-span\" style=\"color: rgb(51, 51, 51); font-family: \'times new roman\', Verdana, Arial, Helvetica, sans-serif; font-size: 13px; font-style: italic; line-height: 16px; \">Живая графика знака поддержана во&nbsp;всех средствах визуальной коммуникации, что способствует созданию &laquo;сквозной&raquo; идентичности.</span></span></span></p>\r\n			</td>\r\n		</tr>\r\n	</tbody>\r\n</table>' WHERE `id` = 3

  def destroy
    @project = Project.find(params[:id])
    @project.destroy
---
SELECT * FROM `projects` WHERE (`projects`.`id` = 1)
DELETE FROM `projects` WHERE `id` = 1