app/controllers/pages_controller.rb

  def index
    @page = Page.first
---
SELECT * FROM `pages` LIMIT 1

  def show
    @page = Page.find_by_id(params[:id])
---
SELECT * FROM `pages` WHERE (`pages`.`id` = '5') LIMIT 1