app/controllers/pages_controller.rb

SELECT * FROM `pages` WHERE (`pages`.`visible` = 1) ORDER BY position LIMIT 1
---
  def index
    @page = Page.find(:first, :conditions =>  {:visible => false })

SELECT * FROM `pages`
---
  def show
    @page = Page.find_by_id(params[:id])
    if @page.root? && @page.children.size > 0