app/controllers/portfolio_controller.rb

SELECT * FROM `projects` WHERE (`projects`.`section` = 'sites') GROUP BY client_id
---
  def images
    @projects = Project.find(:all, :conditions => {:section => params[:section]})

SELECT * FROM `projects` WHERE (`projects`.`id` = 2)
---
  def show
    @project = Project.find(params[:id])

SELECT * FROM `pages` WHERE (`pages`.`permalink` = 'portfolio') LIMIT 1
---
  def find_page
    @page = Page.find_by_permalink("portfolio")