app/controllers/redirect_controller.rb

  def index
    if Array === params[:path]
      @page = Page.find_by_path("/"+params[:path].join("/"))
---
SELECT * FROM `pages` WHERE (`pages`.`path` = '') LIMIT 1